Revit 2024 API
ImageType.Status Property
 The status of the image
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public ImageTypeStatus Status { get; }
Visual Basic
Public ReadOnly Property Status As ImageTypeStatus
	Get
Visual C++
public:
property ImageTypeStatus Status {
	ImageTypeStatus get ();
}
See Also
ImageType Class
Autodesk.Revit.DB Namespace